{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 20, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.2, "input_dtype": "float32", "batch_input_shape": [null, 400, 60], "input_length": null, "dropout_W": 0.2, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "forward_lstm_4", "go_backwards": false, "input_dim": 60, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}}, "name": "bidirectional_4", "merge_mode": "concat", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 400, 60]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1}}, "trainable": true, "name": "timedistributed_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}]}